{
  "nodes": [
    {
      "op": "null",
      "param": {},
      "name": "data",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(7, 7)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(3, 3)",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "name": "conv_1",
      "inputs": [[0, 0], [1, 0], [2, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_1",
      "inputs": [[3, 0], [4, 0], [5, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_1",
      "inputs": [[6, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(0, 0)",
        "pool_type": "max",
        "stride": "(2, 2)"
      },
      "name": "max_pool_1",
      "inputs": [[7, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_2_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_2_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_2_reduce",
      "inputs": [[8, 0], [9, 0], [10, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_2_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_2_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_2_1",
      "inputs": [[11, 0], [12, 0], [13, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_2_1",
      "inputs": [[14, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_2_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_2_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_2",
      "inputs": [[15, 0], [16, 0], [17, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_2_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_2_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_2",
      "inputs": [[18, 0], [19, 0], [20, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_2",
      "inputs": [[21, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(0, 0)",
        "pool_type": "max",
        "stride": "(2, 2)"
      },
      "name": "max_pool_2",
      "inputs": [[22, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_1x1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_1x1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_1x1",
      "inputs": [[23, 0], [24, 0], [25, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_1x1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_1x1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_1x1",
      "inputs": [[26, 0], [27, 0], [28, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_1x1",
      "inputs": [[29, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_3x3_reduce",
      "inputs": [[23, 0], [31, 0], [32, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_3x3_reduce",
      "inputs": [[33, 0], [34, 0], [35, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_3x3_reduce",
      "inputs": [[36, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_3x3_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_3x3_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_3x3",
      "inputs": [[37, 0], [38, 0], [39, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_3x3_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_3x3_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_3x3",
      "inputs": [[40, 0], [41, 0], [42, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_3x3",
      "inputs": [[43, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_double_3x3_reduce",
      "inputs": [[23, 0], [45, 0], [46, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_double_3x3_reduce",
      "inputs": [[47, 0], [48, 0], [49, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_double_3x3_reduce",
      "inputs": [[50, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_0_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_0_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_double_3x3_0",
      "inputs": [[51, 0], [52, 0], [53, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_0_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_0_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_double_3x3_0",
      "inputs": [[54, 0], [55, 0], [56, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_double_3x3_0",
      "inputs": [[57, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_double_3x3_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_double_3x3_1",
      "inputs": [[58, 0], [59, 0], [60, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_double_3x3_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_double_3x3_1",
      "inputs": [[61, 0], [62, 0], [63, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_double_3x3_1",
      "inputs": [[64, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "avg",
        "stride": "(1, 1)"
      },
      "name": "avg_pool_3a_pool",
      "inputs": [[23, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_proj_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3a_proj_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "32",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3a_proj",
      "inputs": [[66, 0], [67, 0], [68, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_proj_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3a_proj_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3a_proj",
      "inputs": [[69, 0], [70, 0], [71, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3a_proj",
      "inputs": [[72, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Concat",
      "param": {"num_args": "4"},
      "name": "ch_concat_3a_chconcat",
      "inputs": [[30, 0], [44, 0], [65, 0], [73, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_1x1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_1x1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_1x1",
      "inputs": [[74, 0], [75, 0], [76, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_1x1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_1x1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_1x1",
      "inputs": [[77, 0], [78, 0], [79, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_1x1",
      "inputs": [[80, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_3x3_reduce",
      "inputs": [[74, 0], [82, 0], [83, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_3x3_reduce",
      "inputs": [[84, 0], [85, 0], [86, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_3x3_reduce",
      "inputs": [[87, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_3x3_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_3x3_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_3x3",
      "inputs": [[88, 0], [89, 0], [90, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_3x3_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_3x3_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_3x3",
      "inputs": [[91, 0], [92, 0], [93, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_3x3",
      "inputs": [[94, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_double_3x3_reduce",
      "inputs": [[74, 0], [96, 0], [97, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_double_3x3_reduce",
      "inputs": [[98, 0], [99, 0], [100, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_double_3x3_reduce",
      "inputs": [[101, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_0_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_0_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_double_3x3_0",
      "inputs": [[102, 0], [103, 0], [104, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_0_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_0_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_double_3x3_0",
      "inputs": [[105, 0], [106, 0], [107, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_double_3x3_0",
      "inputs": [[108, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_double_3x3_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_double_3x3_1",
      "inputs": [[109, 0], [110, 0], [111, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_double_3x3_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_double_3x3_1",
      "inputs": [[112, 0], [113, 0], [114, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_double_3x3_1",
      "inputs": [[115, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "avg",
        "stride": "(1, 1)"
      },
      "name": "avg_pool_3b_pool",
      "inputs": [[74, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_proj_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3b_proj_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3b_proj",
      "inputs": [[117, 0], [118, 0], [119, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_proj_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3b_proj_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3b_proj",
      "inputs": [[120, 0], [121, 0], [122, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3b_proj",
      "inputs": [[123, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Concat",
      "param": {"num_args": "4"},
      "name": "ch_concat_3b_chconcat",
      "inputs": [[81, 0], [95, 0], [116, 0], [124, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3c_3x3_reduce",
      "inputs": [[125, 0], [126, 0], [127, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3c_3x3_reduce",
      "inputs": [[128, 0], [129, 0], [130, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3c_3x3_reduce",
      "inputs": [[131, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_3x3_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_3x3_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "160",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "name": "conv_3c_3x3",
      "inputs": [[132, 0], [133, 0], [134, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_3x3_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_3x3_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3c_3x3",
      "inputs": [[135, 0], [136, 0], [137, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3c_3x3",
      "inputs": [[138, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3c_double_3x3_reduce",
      "inputs": [[125, 0], [140, 0], [141, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3c_double_3x3_reduce",
      "inputs": [[142, 0], [143, 0], [144, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3c_double_3x3_reduce",
      "inputs": [[145, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_0_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_0_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_3c_double_3x3_0",
      "inputs": [[146, 0], [147, 0], [148, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_0_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_0_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3c_double_3x3_0",
      "inputs": [[149, 0], [150, 0], [151, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3c_double_3x3_0",
      "inputs": [[152, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_3c_double_3x3_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(2, 2)",
        "workspace": "512"
      },
      "name": "conv_3c_double_3x3_1",
      "inputs": [[153, 0], [154, 0], [155, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_3c_double_3x3_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_3c_double_3x3_1",
      "inputs": [[156, 0], [157, 0], [158, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_3c_double_3x3_1",
      "inputs": [[159, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "max",
        "stride": "(2, 2)"
      },
      "name": "max_pool_3c_pool",
      "inputs": [[125, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Concat",
      "param": {"num_args": "3"},
      "name": "ch_concat_3c_chconcat",
      "inputs": [[139, 0], [160, 0], [161, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_1x1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_1x1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "224",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_1x1",
      "inputs": [[162, 0], [163, 0], [164, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_1x1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_1x1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_1x1",
      "inputs": [[165, 0], [166, 0], [167, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_1x1",
      "inputs": [[168, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "64",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_3x3_reduce",
      "inputs": [[162, 0], [170, 0], [171, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_3x3_reduce",
      "inputs": [[172, 0], [173, 0], [174, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_3x3_reduce",
      "inputs": [[175, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_3x3_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_3x3_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_3x3",
      "inputs": [[176, 0], [177, 0], [178, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_3x3_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_3x3_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_3x3",
      "inputs": [[179, 0], [180, 0], [181, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_3x3",
      "inputs": [[182, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_double_3x3_reduce",
      "inputs": [[162, 0], [184, 0], [185, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_double_3x3_reduce",
      "inputs": [[186, 0], [187, 0], [188, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_double_3x3_reduce",
      "inputs": [[189, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_0_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_0_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_double_3x3_0",
      "inputs": [[190, 0], [191, 0], [192, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_0_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_0_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_double_3x3_0",
      "inputs": [[193, 0], [194, 0], [195, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_double_3x3_0",
      "inputs": [[196, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_double_3x3_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_double_3x3_1",
      "inputs": [[197, 0], [198, 0], [199, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_double_3x3_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_double_3x3_1",
      "inputs": [[200, 0], [201, 0], [202, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_double_3x3_1",
      "inputs": [[203, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Pooling",
      "param": {
        "kernel": "(3, 3)",
        "pad": "(1, 1)",
        "pool_type": "avg",
        "stride": "(1, 1)"
      },
      "name": "avg_pool_4a_pool",
      "inputs": [[162, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_proj_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4a_proj_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4a_proj",
      "inputs": [[205, 0], [206, 0], [207, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_proj_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4a_proj_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4a_proj",
      "inputs": [[208, 0], [209, 0], [210, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4a_proj",
      "inputs": [[211, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Concat",
      "param": {"num_args": "4"},
      "name": "ch_concat_4a_chconcat",
      "inputs": [[169, 0], [183, 0], [204, 0], [212, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_1x1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_1x1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "192",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_1x1",
      "inputs": [[213, 0], [214, 0], [215, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_1x1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_1x1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_1x1",
      "inputs": [[216, 0], [217, 0], [218, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_1x1",
      "inputs": [[219, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_3x3_reduce",
      "inputs": [[213, 0], [221, 0], [222, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_3x3_reduce",
      "inputs": [[223, 0], [224, 0], [225, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_3x3_reduce",
      "inputs": [[226, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_3x3_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_3x3_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_3x3",
      "inputs": [[227, 0], [228, 0], [229, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_3x3_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_3x3_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_3x3",
      "inputs": [[230, 0], [231, 0], [232, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_3x3",
      "inputs": [[233, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_reduce_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_reduce_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(1, 1)",
        "no_bias": "False",
        "num_filter": "96",
        "num_group": "1",
        "pad": "(0, 0)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_double_3x3_reduce",
      "inputs": [[213, 0], [235, 0], [236, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_reduce_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_reduce_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_double_3x3_reduce",
      "inputs": [[237, 0], [238, 0], [239, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_double_3x3_reduce",
      "inputs": [[240, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_0_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_0_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_double_3x3_0",
      "inputs": [[241, 0], [242, 0], [243, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_0_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_0_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_double_3x3_0",
      "inputs": [[244, 0], [245, 0], [246, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_double_3x3_0",
      "inputs": [[247, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_1_weight",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "conv_4b_double_3x3_1_bias",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "Convolution",
      "param": {
        "kernel": "(3, 3)",
        "no_bias": "False",
        "num_filter": "128",
        "num_group": "1",
        "pad": "(1, 1)",
        "stride": "(1, 1)",
        "workspace": "512"
      },
      "name": "conv_4b_double_3x3_1",
      "inputs": [[248, 0], [249, 0], [250, 0]],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_1_gamma",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "null",
      "param": {},
      "name": "bn_4b_double_3x3_1_beta",
      "inputs": [],
      "backward_source_id": -1
    },
    {
      "op": "BatchNorm",
      "param": {
        "eps": "1e-4",
        "fix_gamma": "False",
        "momentum": "0.9"
      },
      "name": "bn_4b_double_3x3_1",
      "inputs": [[251, 0], [252, 0], [253, 0]],
      "backward_source_id": -1
    },
    {
      "op": "Activation",
      "param": {"act_type": "relu"},
      "name": "relu_4b_double_3x3_1",
      "inputs": [[254, 0]],
